{
  "paragraphs": [
    {
      "id": "professional",
      "title": "Professional",
      "image": "work.png",
      "sections": [
        {
          "img": "soprasteria.png",
          "date": "10/2021 - 12/2023",
          "title": "Senior Front End Engineer - SopraSteria (London)",
          "technologies": "React, Typescript, Javascript, CI/CD, Redux, Redux-Saga, TDD, Jest, Enzyme, Git, W3C, Html & sass.",
          "achieving": "Working in an agile scrum team developing the world leading traffic management system for Transport For London. My day to day consists in taking full responsibility for developing new functionalities and fixing bugs, collaborating with different teams and roles and managing the workload to deliver it in time respecting the security and quality standards.",
          "link": "https://www.soprasteria.com/newsroom/press-releases/details/sopra-steria-and-tfl-develop-world-leading-traffic-management-system-to-keep-london-moving"
        },
        {
          "img": "rehab.svg",
          "date": "12/2019 - 07/2021",
          "title": "Full Stack Engineer - Rehab (London)",
          "technologies": "React, Javascript, CI/CD, Python, Django, Redux, Redux-Form, Redux-Saga, Docker, NextJS, TDD, NodeJS, Firebase, Git, W3C, Html & Css.",
          "achieving": "Worked in amazing projects for global clients like Nike, Google, WarnerMedia, Estée Lauder and many others in which I had complete ownership and responsibility in some projects, interacted, collaborated with clients and team members from different fields of expertise and fixed and added new features in a large internal platform.",
          "link": "https://www.rehabagency.ai/"
        },
        {
          "img": "covidzoe.png",
          "date": "03/2020 - 06/2020",
          "title": "Open Source - COVID Symptom Study - ZOE",
          "technologies": "React Native, Typescript, Formik, svg, i18n, TDD & Redux.",
          "achieving": "Created custom components, updated app style and fixed key accessibility issues.",
          "link": "https://github.com/zoe/covid-tracker-react-native"
        },
        {
          "img": "gestionaleauto.png",
          "date": "05/2019 - 10/2019",
          "title": "GestionaleAuto.com - React Developer",
          "technologies": "React, Javascript, Redux, Redux-Form, Redux-Saga, Html & Scss.",
          "achieving": "Learned to work in Agile Scrum team: my daily tasks ranged from refactoring to developing new features for a large management software. In which I managed to improve the simplicity and performance of some components, making them 30-40% faster.",
          "link": "https://gestionaleauto.com/"
        },
        {
          "img": "discontinuity.png",
          "date": "10/2018 - 04/2019",
          "title": "Discontinuity - Full Stack Developer",
          "technologies": "React Native, React, Javascript, Gatsby, AWS, DynamoDB, GraphQL, Html & Scss.",
          "achieving": "Worked in an agile team, my daily tasks were to maintain and develop apps and websites from scratch too.",
          "link": "http://discontinuity.eu/"
        }
      ]
    },
    {
      "id": "education",
      "title": "Education",
      "image": "education.png",
      "sections": [
        {
          "date": "2015 - 2019",
          "title": "University of Padua - Computer Science",
          "technologies": "C++, SQL, Java, Javascript, Php, html, css, React Native & React.",
          "achieving": "It gave me the mental flexibility to learn new programming languages quickly, handle pointers, object-oriented and concurrent programming."
        }
      ]
    },
    {
      "id": "passion",
      "title": "Passion",
      "image": "passions.png",
      "sections": [
        {
          "date": "-",
          "title": "Programming",
          "description": "I love programming, it allows me to create applications and websites which many people could benefit from."
        },
        {
          "date": "-",
          "title": "Permaculture and vegetable garden",
          "description": "These two passions of mine allow me to get my hands dirty, free my mind and appreciate how much nature can give us."
        }
      ]
    },
    {
      "id": "experience",
      "title": "Experience",
      "image": "experiences.png",
      "sections": [
        {
          "date": "11/2019 - 03/2020",
          "title": "Volunteer help organizer - (GDG) Cloud London",
          "description": "<b>Google Developer Group</b> Cloud London is the most active developer group on the meetup platform in the world! </br> We organise hacks several times a week every week. We have a general talk once a month. And we usually have several workshops once a month. </br>  We strive to learn and share knowledge about challenging topics in a casual friendly respectful atmosphere.",
          "link": "https://www.meetup.com/it-IT/gdgcloud/"
        },
        {
          "date": "21/03/2019 & 29/11/2018",
          "title": "{Codemotion} Rome & {Codemotion} Milan",
          "description": "(Participated) Codemotion is the biggest tech conference in Italy and one of the most important in Europe. Here I had the chance to meet new people who shared my passions and follow front-end and react talks which allowed me to improve the quality of my code and learn new things.",
          "link": "https://about.codemotion.com/"
        },
        {
          "date": "26/05/2018",
          "title": "Hackathon won (React + Typescript)",
          "description": "First prize winning with a web application developed with the use of the <b>React</b> library and the <b>Google Maps API.</b>",
          "link": "https://github.com/CristianMaschio/FE-ProgettoCastelfrancoVeneto"
        },
        {
          "date": "10/2017 - 07/2018",
          "title": "University project - Social web app (Typescript + React + NodeJs + Jest + CircleCi)",
          "description": "This project gave me the opportunity to collaborate with 6 other unknown people, including a freelancer who gave me a solid foundation of React."
        },
        {
          "date": "2017",
          "title": "University project - Mobile app (React Native)",
          "description": "Here on my voluntary request for the Mobile Programming and Multimedia course, I decided to create an application with React Native, to discover the mobile world with React and learning the basics of React Native.",
          "link": "https://github.com/CristianMaschio/Progetto_MPM_React_Native"
        },
        {
          "date": "24/11/2018",
          "title": "DevFest Veneto - GDG Venice",
          "description": "I participated to the DevFest organized by Google Developers Group Venice.",
          "link": "https://gdg-venezia.github.io/devfest-veneto-18/"
        }
      ],
      "more": [
        {
          "date": "2018 - 2019",
          "title": "Coding Gym - Programmers in Padua",
          "description": "I participated to some \"4-5\" Coding Gym. Coding Gym is an international format of programming laboratories open to any language and developed for continuous improvement.",
          "link": "https://www.programmersinpadua.it/"
        },
        {
          "date": "2018 - 2019",
          "title": "Talks - Programmers in Padua",
          "description": "I participated to some talks. Programmers in Padua is a little community, who work and passionate about programming, new technologies and startups. We meet once a month in an open and informal environment, where the participants propose themselves for the talks.",
          "link": "https://www.programmersinpadua.it/"
        }
      ]
    }
  ]
}